In [2]:
import pandas as pd
import numpy as np

# Converting Strings to Dates

In [3]:
## Creating strings
date_strings = np.array(['13-03-2005 11:35 PM'])

## Converting to datetimes
pd.to_datetime(date_strings, format = '%d-%m-%Y %I:%M %p')

DatetimeIndex(['2005-03-13 23:35:00'], dtype='datetime64[ns]', freq=None)

# Handling Time Zones

In [5]:
## Creating time in London
pd.Timestamp('2018-05-24 01:01:01', tz = 'Europe/London')

Timestamp('2018-05-24 01:01:01+0100', tz='Europe/London')

# Selecting Dates

In [10]:
## Creating a data-frame
data = pd.DataFrame({'Date': pd.date_range('1/1/2001', periods = 100)})
data

         Date
0  2001-01-01
1  2001-01-02
2  2001-01-03
3  2001-01-04
4  2001-01-05
..        ...
95 2001-04-06
96 2001-04-07
97 2001-04-08
98 2001-04-09
99 2001-04-10

[100 rows x 1 columns]

In [12]:
## Selecting dates between two date-times
data[(data['Date'] > '2001-01-02') & (data['Date'] < '2001-03-21')]

         Date
2  2001-01-03
3  2001-01-04
4  2001-01-05
5  2001-01-06
6  2001-01-07
..        ...
74 2001-03-16
75 2001-03-17
76 2001-03-18
77 2001-03-19
78 2001-03-20

[77 rows x 1 columns]

# Breaking Up Date into Multiple Features